; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	Star7 - direction
	Star6 - direction
	Star8 - direction
	Star2 - direction
	Star0 - direction
	GroundStation5 - direction
	GroundStation9 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star6)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star2)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star0)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation9)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 spectrograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon14)
)
(:goal (and
	(pointing satellite1 Star7)
	(have_image Phenomenon10 image1)
	(have_image Planet11 image1)
	(have_image Star12 image1)
	(have_image Planet13 image1)
	(have_image Phenomenon14 spectrograph0)
	(have_image Planet15 image1)
	(have_image Planet16 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star7)
   goals met: 1 of 8
2. (turn_to satellite0 groundstation9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation9)
   goals met: 1 of 8
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
4. (calibrate satellite0 instrument0 groundstation9)
   added: (calibrated instrument0)
   goals met: 1 of 8
5. (turn_to satellite0 planet11 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 planet11)
   goals met: 1 of 8
6. (take_image satellite0 planet11 instrument0 image1)
   added: (have_image planet11 image1)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon14 instrument0 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 3 of 8
9. (turn_to satellite0 phenomenon10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 8
10. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 4 of 8
11. (turn_to satellite0 planet13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet13)
   goals met: 4 of 8
12. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 5 of 8
13. (turn_to satellite0 planet15 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet15)
   goals met: 5 of 8
14. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 6 of 8
15. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 6 of 8
16. (take_image satellite0 planet16 instrument0 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 7 of 8
17. (turn_to satellite0 star12 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star12)
   goals met: 7 of 8
18. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 8 of 8
